DimaFantasy/LPP/LPP_STM32G431CBTx/Core/Src/main.c
        TIM2->CR1 &= ~TIM_CR1_OPM; // Непрерывный режим

        TIM_OC_InitTypeDef sConfigOC = {0};
        sConfigOC.OCMode = TIM_OCMODE_TIMING;
        HAL_TIM_OC_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1);

        // Порядок важен: сначала EGR сброс, потом прерывания
        TIM2->DIER = 0;
        TIM2->EGR |= TIM_EGR_UG;
        TIM2->SR   = 0;
        TIM2->DIER |= TIM_DIER_UIE | TIM_DIER_CC1IE;

        HAL_NVIC_SetPriority(TIM2_IRQn, 5, 0);
        HAL_NVIC_EnableIRQ(TIM2_IRQn);

        TIM2->CR1 |= TIM_CR1_CEN;
    }

    X_MOTOR_MODE = mode;
}

/**
 * @brief Программная задержка dead-time между переключением ключей моста
 * ~1 мкс при 170МГц. Подобрать осциллографом!
 */
__STATIC_INLINE void XMotorDeadTime(void) {
    for (volatile int i = 0; i < 100; i++) { __NOP(); }
}

// Желаемое направление
static volatile uint8_t X_DIR_NEXT = 0; // 0 = вперёд, 1 = назад

void TIM2_IRQHandler(void) {
    uint32_t sr = TIM2->SR;

    if (sr & TIM_SR_UIF) {
        TIM2->SR = ~TIM_SR_UIF;

        XTimerCallback();

        if (X_MOTOR_MODE != X_MOTOR_MODE_STEP) {

            // ✅ Сброс пинов с учётом режима
            F_RESET_PIN(&g_pins[PIN_X_MO_L]);
            F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
            // PIN_X_MO_R — DIR в ONE_PWM, сбрасываем только в TWO_PWM
            if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) {
                F_RESET_PIN(&g_pins[PIN_X_MO_R]);
            }

            if (X_PWM_CURRENT != 0) {
                XMotorDeadTime();

                if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) {
                    uint32_t abs_pwr = (uint32_t)abs(X_PWM_CURRENT);
                    if (abs_pwr > 5000) abs_pwr = 5000;
                    TIM2->CCR1 = abs_pwr;

                    uint8_t fwd = (X_PWM_CURRENT > 0) ? 1 : 0;
                    if (W_X_POL_PWM) fwd = !fwd;

                    if (fwd) {
                        F_SET_PIN(&g_pins[PIN_X_MO_L]);
                        F_SET_PIN(&g_pins[PIN_X_MO_R_H]);
                    } else {
                        F_SET_PIN(&g_pins[PIN_X_MO_R]);
                        F_SET_PIN(&g_pins[PIN_X_MO_L_H]);
                    }
                }
                else if (X_MOTOR_MODE == X_MOTOR_MODE_ONE_PWM) {
                    uint32_t abs_pwr = (uint32_t)abs(X_PWM_CURRENT);
                    if (abs_pwr > 5000) abs_pwr = 5000;
                    TIM2->CCR1 = abs_pwr;

                    // DIR уже выставлен в CC1IF — не трогаем
                    X_PWM_SET();
                }
            }
        }
    }

    if (sr & TIM_SR_CC1IF) {
        TIM2->SR = ~TIM_SR_CC1IF;

        if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) {
            // ✅ Гасим все ключи — в TWO_PWM PIN_X_MO_R это ключ моста
            F_RESET_PIN(&g_pins[PIN_X_MO_L]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R]);
            F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
        }
        else if (X_MOTOR_MODE == X_MOTOR_MODE_ONE_PWM) {
            // Гасим только ШИМ, DIR (PIN_X_MO_R) не трогаем
            X_PWM_CLR();

            // Обновляем DIR в паузе между импульсами
            X_DIR_NEXT = (X_PWM_CURRENT >= 0) ? 0 : 1;
            if (X_DIR_NEXT) X_DIR_SET();
            else            X_DIR_CLR();
        }
    }
}

/**
 * @brief Установка длительности шага (только для STEP режима)
 * @param period: длительность в мкс (при PSC=169, 1 тик = 1 мкс)
 */
void XTimerSet(uint16_t period) {
    if (X_MOTOR_MODE == X_MOTOR_MODE_STEP) {
        TIM2->ARR  = period;
        TIM2->CNT  = 0;
        TIM2->SR   = 0;             // сброс UIF перед стартом
        TIM2->CR1 |= TIM_CR1_CEN;  // старт одного импульса (OPM)
    }
}

/**
 * @brief Установка мощности мотора X
 * @param power: -5000..+5000 (0 = стоп)
 */
void XMotorSet(int power) {
    if (X_MOTOR_MODE == X_MOTOR_MODE_STEP) return;
    if (abs(power) < 10) power = 0;
	
    X_PWM_CURRENT = power;

    if (power == 0) {
        TIM2->CCR1 = 0;
        F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
        F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
        X_DIR_CLR();
        X_PWM_CLR();
        X_DIR_NEXT = 0; // ✅ сброс
    } else {
        if (power >  5000) power =  5000;
        if (power < -5000) power = -5000;
        TIM2->CCR1 = (uint32_t)abs(power);
    }
}

// ============================================================================
// ПОДСИСТЕМА PWM LASER & LIGHT (DMA-BASED)
// ============================================================================

// Глобальные переменные для работы DMA лазер
volatile uint32_t dma_pwm_masks[3][2] = {0}; // [Laser, LED1, LED2][SET, RESET]
uint32_t raw_pin_masks[3] = {0};             // Маски пинов (1 << N)
uint32_t LAST_LASER_FREQ = 0;                // Для защиты от повторной инициализации

/**
 * @brief Привязка физических портов к каналам DMA.
 */
void PWM_LaserLight_LinkHardware(void) {
    uint8_t target_ids[3] = { PIN_PWM_LASER, PIN_PWM_LED1, PIN_PWM_LED2 };

    for (int i = 0; i < 3; i++) {
        PIN_CFG_T *cfg = &g_pins[target_ids[i]];
        
        // Канал ON:  1, 2, 3 (соответствуют i = 0, 1, 2)
        // Канал OFF: 4, 5, 6 (соответствуют i+3)
        DMA_Channel_TypeDef* ch_on  = (DMA_Channel_TypeDef*)((uint32_t)DMA1_Channel1 + (i * 0x14));
        DMA_Channel_TypeDef* ch_off = (DMA_Channel_TypeDef*)((uint32_t)DMA1_Channel1 + ((i + 3) * 0x14));

        if (!cfg->used || cfg->bsrr == (uint32_t*)&GPIO_NULL_REG) {
            ch_on->CCR &= ~DMA_CCR_EN;
            ch_off->CCR &= ~DMA_CCR_EN;
            continue;
        }

        raw_pin_masks[i] = cfg->pin;

        // Настройка ON
        ch_on->CCR &= ~DMA_CCR_EN;
        ch_on->CPAR = (uint32_t)cfg->bsrr;
        ch_on->CMAR = (uint32_t)&dma_pwm_masks[i][0];
        ch_on->CCR |= DMA_CCR_EN;

        // Настройка OFF
        ch_off->CCR &= ~DMA_CCR_EN;
        ch_off->CPAR = (uint32_t)cfg->bsrr;
        ch_off->CMAR = (uint32_t)&dma_pwm_masks[i][1];
        ch_off->CCR |= DMA_CCR_EN;
    }
}

/**
 * @brief Инициализация таймера и DMA для лазера
 */
void SetLaserLightPWMFrequency(uint32_t freq_hz) {
    if (freq_hz == LAST_LASER_FREQ && freq_hz != 0) return;
    
    if (freq_hz == 0) { 
        TIM1->CR1 &= ~TIM_CR1_CEN; 
        LAST_LASER_FREQ = 0; 
        return; 
    }

    // 1. Включение тактирования
    __HAL_RCC_TIM1_CLK_ENABLE();
    __HAL_RCC_DMA1_CLK_ENABLE();
    __HAL_RCC_DMAMUX1_CLK_ENABLE();

    // 2. ИСПРАВЛЕННЫЙ РАСЧЕТ ЧАСТОТЫ ТАЙМЕРА (TIM1 на APB2)
    uint32_t pclk2 = HAL_RCC_GetPCLK2Freq();
    uint32_t tim_clk = pclk2;

    // Если делитель APB2 не 1, частота таймера удваивается автоматически
    if ((RCC->CFGR & RCC_CFGR_PPRE2) != RCC_CFGR_PPRE2_DIV1) {
        tim_clk = pclk2 * 2;
    }

    uint32_t arr = 100;
    // PSC = (F_clk / (F_target * (ARR + 1)))
    uint32_t psc_val = tim_clk / (freq_hz * (arr + 1));
    
