DimaFantasy/LPP/LPP_STM32G431CBTx/Core/Src/main.c
    TIM1->PSC = (psc_val > 0) ? psc_val - 1 : 0;
    TIM1->ARR = arr;
    
    // Остальной код без изменений
    TIM1->CCMR1 = 0; 
    TIM1->CCMR2 = 0;
    TIM1->DIER = TIM_DIER_UDE | TIM_DIER_CC1DE | TIM_DIER_CC2DE | TIM_DIER_CC3DE;

		// 3. Настройка каналов DMA (1-6). 
		for (int i = 0; i < 6; i++) {
				uint8_t ch_num = i + 1; // Теперь: 1, 2, 3, 4, 5, 6
				
				uint32_t req;
				// Логика запросов DMAMUX (TIM1 UP для включения, CHx для выключения)
				if (i < 3)       req = LL_DMAMUX_REQ_TIM1_UP;
				else if (i == 3) req = LL_DMAMUX_REQ_TIM1_CH1;
				else if (i == 4) req = LL_DMAMUX_REQ_TIM1_CH2;
				else             req = LL_DMAMUX_REQ_TIM1_CH3;

				// Настройка DMAMUX (каналы мукса 0..5 соответствуют DMA каналам 1..6)
				LL_DMAMUX_SetRequestID(DMAMUX1, ch_num - 1, req); 

				// Расчет адреса канала (смещение 0x14 на каждый канал)
				DMA_Channel_TypeDef* DMA_Ch = (DMA_Channel_TypeDef*)((uint32_t)DMA1_Channel1 + ((ch_num - 1) * 0x14));
				
				DMA_Ch->CCR &= ~DMA_CCR_EN;
				DMA1->IFCR = (0x0F << ((ch_num - 1) * 4)); // Сброс флагов

				DMA_Ch->CCR = DMA_CCR_DIR | DMA_CCR_CIRC | DMA_CCR_MINC | 
											(0x02 << DMA_CCR_PSIZE_Pos) | (0x02 << DMA_CCR_MSIZE_Pos) | 
											LL_DMA_PRIORITY_VERYHIGH; // Максимальный приоритет для лазера
				
				DMA_Ch->CNDTR = 1;

				// Приоритеты прерываний (хотя для лазера они почти не нужны в CIRC режиме)
				IRQn_Type irq = (IRQn_Type)(DMA1_Channel1_IRQn + (ch_num - 1));
				HAL_NVIC_SetPriority(irq, 2, 0); 
				HAL_NVIC_EnableIRQ(irq);
		}

    for(int i=0; i<3; i++) { 
        dma_pwm_masks[i][0] = 0; 
        dma_pwm_masks[i][1] = 0; 
    }

    PWM_LaserLight_LinkHardware();

    TIM1->BDTR |= TIM_BDTR_MOE; 
    TIM1->SR = 0;               
    TIM1->EGR |= TIM_EGR_UG;    
    TIM1->CR1 |= TIM_CR1_CEN;   
    
    LAST_LASER_FREQ = freq_hz;
}

/**
 * @brief Сверхбыстрое управление мощностью лазера (Branchless)
 */
void Laser_Off(void) {
    LASER_SAFETY_LOCK = 1;
    HAL_TIM_Base_Stop_IT(&htim3); 
    SetLaserPWM(0);
    TIM1->EGR |= TIM_EGR_UG;      // Мгновенная очистка регистров
    F_RESET_PIN(&g_pins[PIN_PWM_LASER]); // Физическая гарантия нуля
}

void Laser_Ready(void) {
    TIM3->CNT = 0;                // Обнуляем интерполяцию
    interp_counter = 0; 
    TIM1->CNT = 0;                // Фазируем ШИМ
    TIM1->EGR |= TIM_EGR_UG;      // Пропихиваем нули    
    LASER_SAFETY_LOCK = 0;        // Разрешаем работу
}


inline void SetLaserPWM(uint16_t val) {
    // Если включена блокировка, любое значение превращается в 0
    if (LASER_SAFETY_LOCK) val = 0;

    dma_pwm_masks[0][0] = (uint32_t)(val != 0) * raw_pin_masks[0];
    dma_pwm_masks[0][1] = (uint32_t)(val < 100) * (raw_pin_masks[0] << 16);
    TIM1->CCR1 = val;

    if (val == 0) {
        F_RESET_PIN(&g_pins[PIN_PWM_LASER]);
        dma_pwm_masks[0][0] = 0; // Чистим память для DMA
    }
}


/**
 * @brief Сверхбыстрое управление мощностью подсветки 1
 */
inline void SetLight1PWM(uint16_t val) {    
    dma_pwm_masks[1][0] = (uint32_t)(val != 0) * raw_pin_masks[1];
    dma_pwm_masks[1][1] = (uint32_t)(val < 100) * (raw_pin_masks[1] << 16);
		// Обновляем порог срабатывания таймера	
    TIM1->CCR2 = val;
}

/**
 * @brief Сверхбыстрое управление мощностью подсветки 2
 */
inline void SetLight2PWM(uint16_t val) {  
    dma_pwm_masks[2][0] = (uint32_t)(val != 0) * raw_pin_masks[2];
    dma_pwm_masks[2][1] = (uint32_t)(val < 100) * (raw_pin_masks[2] << 16);
		// Обновляем порог срабатывания таймера    
    TIM1->CCR3 = val;
}



// HAL callback
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim)
{
    // TIM3 - Интерполяция печати
    if (htim->Instance == TIM3) {
        // SDK вариант: один шаг интерполяции
        if (XInterpTimerCallback() == 0) {
            // Возврат 0 означает, что серия интерполяции завершена
            HAL_TIM_Base_Stop_IT(&htim3);	
            TIM3->CNT = 0;  // Сброс счетчика
        }
    }
    // TIM4 - Управление осью Y
    if (htim->Instance == TIM4) {
        YTimerCallback();
    }
}

// установка периода и запуск таймера YTimer
void YTimerSet(uint16_t period)
{
    __HAL_TIM_SET_AUTORELOAD(&htim4, period);
    __HAL_TIM_ENABLE(&htim4);
}



void XInterpTimerStart(uint32_t period) {
    // Старт интерполяционого таймера
    TIM3->ARR = period;          // Установка периода
    TIM3->SR &= ~TIM_SR_UIF;     // Сброс флага прерывания
    TIM3->DIER |= TIM_DIER_UIE;  // Разрешение прерывания
    TIM3->CR1 |= TIM_CR1_CEN;    // Запуск таймера
}

/**
 * @brief Наш собственный быстрый обработчик прерываний
 * @param pin_mask Битовая маска сработавших пинов (например, 0x0020 для Pin 5)
 */
void LPP_GPIO_EXTI_Handler(uint16_t pin_mask) {
    // Здесь мы просто пробрасываем маску в логику энкодера
    // или делаем что-то еще. Пин нам не важен, важен сам факт.
    XEncoderCallback(pin_mask); 
}

// Одиночные линии (0-4)
void EXTI0_IRQHandler(void) { EXTI->PR1 = (1U << 0); LPP_GPIO_EXTI_Handler(1U << 0); }
void EXTI1_IRQHandler(void) { EXTI->PR1 = (1U << 1); LPP_GPIO_EXTI_Handler(1U << 1); }
void EXTI2_IRQHandler(void) { EXTI->PR1 = (1U << 2); LPP_GPIO_EXTI_Handler(1U << 2); }
void EXTI3_IRQHandler(void) { EXTI->PR1 = (1U << 3); LPP_GPIO_EXTI_Handler(1U << 3); }
void EXTI4_IRQHandler(void) { EXTI->PR1 = (1U << 4); LPP_GPIO_EXTI_Handler(1U << 4); }

// Групповые линии (5-9)
void EXTI9_5_IRQHandler(void) {
    uint32_t pr = EXTI->PR1 & 0x03E0; 
    if (pr) {
        EXTI->PR1 = pr; // Сбрасываем флаги
        LPP_GPIO_EXTI_Handler(pr); 
    }
}

// Групповые линии (10-15)
void EXTI15_10_IRQHandler(void) {
    uint32_t pr = EXTI->PR1 & 0xFC00; 
    if (pr) {
        EXTI->PR1 = pr; 
        LPP_GPIO_EXTI_Handler(pr);
    }
}

// ============================================================================
// Инициализация DMA для Memory-to-Memory
// ============================================================================

// Глобальные переменные для работы DMA MemToMem
DMA_HandleTypeDef hdma_m2m_dma2_ch1; 

volatile uint8_t LPP_DataReady = 0;

void DMA_M2M_Init(void) {
    __HAL_RCC_DMA2_CLK_ENABLE(); 
    __HAL_RCC_DMAMUX1_CLK_ENABLE();
    __DSB(); 

    DMA2_Channel1->CCR = 0;
    while(DMA2_Channel1->CCR & DMA_CCR_EN);
    
    // Очистка флагов
    DMA2->IFCR = DMA_IFCR_CGIF1;
    
